"""
在python中运算符包括:
    算术运算符
    比较（关系）运算符
    赋值运算符
    逻辑运算符
    位运算符
    成员运算符
    身份运算符
    运算符优先级
"""

"""
 算数运算符
    + 加法
    - 减法
    * 乘法
    / 除法
    % 取模-返回除法的余数
    ** 幂
    // 取整除-往小的方向发展
"""

"""
比较运算符
    == 等于
    > 大于
    < 小于
    != 不等于
    >= 大于等于
    <= 小于等于
"""

"""
赋值运算符
    = 赋值
    += 加法赋值
    -= 减法赋值
    *= 乘法赋值
    /= 除法赋值
    %= 取模赋值
    **= 幂赋值
    //= 整除赋值
    := 海象,可以在表达式内部为变量赋值
"""

"""
位运算符
    & 按位与运算符：参与运算的两个值,如果两个相应位都为1,则该位的结果为1,否则为0
    | 按位或运算符: 只要对应的二个二进位有一个为1时,结果位就为1
    ^ 按位异或运算符：当两对应的二进位相异时,结果为1
    ~ 按位取反运算符：对数据的每个二进制位取反,即把1变为0,把0变为1。~x 类似于 -x-1
    << 左移动运算符：运算数的各二进位全部左移若干位，由"<<"右边的数指定移动的位数,高位丢弃,低位补0。
    >> 右移动运算符：把">>"左边的运算数的各二进位全部右移若干位，">>"右边的数指定移动的位数
"""

"""
逻辑运算符
    and 布尔"与" - 如果 x 为 False,x and y 返回 x 的值，否则返回 y 的计算值。
    or  布尔"或" - 如果 x 是 True,它返回 x 的值，否则它返回 y 的计算值。
    not 布尔"非" - 如果 x 为 True,返回 False 。如果 x 为 False,它返回 True。
"""

"""
成员运算符
    in 	如果在指定的序列中找到值返回 True,否则返回 False
    not in 如果在指定的序列中没有找到值返回 True,否则返回 False。
"""

"""
身份运算符
    is 判断两个标识符是不是引用自一个对象
    not is 判断两个标识符是不是引用自不同对象
"""
1