"""
python3 常见的数据类型：
    Number(数字)
    String(字符串)
    bool(布尔类型)
    List(列表)
    Tuple(元组)
    Set(集合)
    Dictionary(字典)

不可变的类型为:Number(数字),String(字符串),Tuple(元组)
    不可变：在创建后不可被修改的数据类型。每当对不可变对象进行修改时，实际上是创建了一个新的对象，而原始对象保持不变

  可变数据类型为:List(列表),Dictionary(字典),Set(集合)
    可变：创建后可以被修改的数据类型。对可变对象的操作会直接修改该对象的值，而不是创建一个新的对象
"""

# Number(数字)
# int(整数)、folat(浮点数)、complex(复数)
# 整数
a = 100
# 整数是没有小数部分的数值，可以是正数、负数或零。在Python中，整数类型可以表示任意大小的整数
b = 1.12  # 浮点数
# 浮点数用于表示带有小数部分的数值。浮点数采用浮点数表示法，由整数部分和小数部分组成，用小数点分隔
c = 1.1j  # 复数
# 复数用于表示具有实部和虚部的数值。复数由实部和虚部构成，实部和虚部都是浮点数
